Knarf11235/SD-Code-/Power_Chip_Test_Old/Power_Chip_Test.cydsn/Generated_Source/PSoC4/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.2
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "I2C_1.h"
#include "I2C_1_I2C.h"
#include "I2C_1_PINS.h"
#include "I2C_1_I2C_PVT.h"
#include "I2C_1_PVT.h"
#include "I2C_1_BOOT.h"
#include "VR_EN.h"
#include "VR_EN_aliases.h"
#include "LF_Relay.h"
#include "LF_Relay_aliases.h"
#include "HF_Relay.h"
#include "HF_Relay_aliases.h"
#include "COMP_Relay.h"
#include "COMP_Relay_aliases.h"
#include "LF_CB.h"
#include "LF_CB_aliases.h"
#include "HF_CB.h"
#include "HF_CB_aliases.h"
#include "COMP_CB.h"
#include "COMP_CB_aliases.h"
#include "BLUE.h"
#include "BLUE_aliases.h"
#include "GREEN.h"
#include "GREEN_aliases.h"
#include "RED.h"
#include "RED_aliases.h"
#include "MyUART_1.h"
#include "MyUART_1_PVT.h"
#include "I2C_1_SCBCLK.h"
#include "I2C_1_sda.h"
#include "I2C_1_sda_aliases.h"
#include "I2C_1_scl.h"
#include "I2C_1_scl_aliases.h"
#include "I2C_1_SCB_IRQ.h"
#include "core_cm0_psoc4.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cyPm.h"
#include "cytypes.h"
#include "cypins.h"
#include "CyLFClk.h"
#include "cy_em_eeprom.h"

/*[]*/

